module.exports = {
    用于研发阶段的命令行工具集_这一文件夹之相对路径_默认值: '用于研发阶段的命令行工具集',

    在_PowerShell_命令行范本中需替换为当前_npm_的_产品级_依赖包列表的占位文本: '将在此处插入当前 npm 项目的【产品级】依赖包的列表',
    在_PowerShell_命令行范本中需替换为当前_npm_的_研发级_依赖包列表的占位文本: '将在此处插入当前 npm 项目的【研发级】依赖包的列表',

    在_Bash_命令行范本中需替换为当前_npm_的_产品级_依赖包列表的占位文本_凡可自由采用其版本者: '将在此处插入当前 npm 项目的【产品级】、【可自由采取其版本】的依赖包的列表',
    在_Bash_命令行范本中需替换为当前_npm_的_产品级_依赖包列表的占位文本_凡须锁定其版本范围者: '将在此处插入当前 npm 项目的【产品级】、【须锁定其版本范围】依赖包的列表',

    在_Bash_命令行范本中需替换为当前_npm_的_研发级_依赖包列表的占位文本_凡可自由采取其版本者: '将在此处插入当前 npm 项目的【研发级】、【可自由采取其版本】依赖包的列表',
    在_Bash_命令行范本中需替换为当前_npm_的_研发级_依赖包列表的占位文本_凡须锁定其版本范围者: '将在此处插入当前 npm 项目的【研发级】、【须锁定其版本范围】依赖包的列表',
}
