#!/bin/bash

source  './源代码/发布的源代码/bash/吴乐川-管理某-npm-项目的依赖包等资源.sh'

# -------------------------------------------------------
#           按需删除 node_modules 文件夹
#           按需删除 package-lock.json 文件
# -------------------------------------------------------

Remove-吴乐川管理某_npm_项目__删除当前文件夹下的_node_modules       -应执行该步骤 $false
Remove-吴乐川管理某_npm_项目__删除当前文件夹下的_package_lock_json  -应执行该步骤 $false





# -------------------------------------------------------
#           配置各依赖包可安装之版本
# - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# 顺便提醒，虽然一般而言 latest 版本应恰为最高版本，但并不确保。
# -------------------------------------------------------

Update-吴乐川更新当前_npm_项目的某批依赖包  --这批依赖包之依赖类别 '本产品拟囊括这些软件之整体或部分'  --这批依赖包之配置集 $TODO
Update-吴乐川更新当前_npm_项目的某批依赖包  --这批依赖包之依赖类别 '本产品仅会在研发阶段借助这些软件'  --这批依赖包之配置集 $TODO





# -------------------------------------------------------
#           更新与研发相关的数据库
# - - - - - - - - - - - - - - - - - - - - - - - - - - - -
#     例如： Browserslist:caniuse-lite
# -------------------------------------------------------

Write-吴乐川管理某_npm_项目__打印提示语__更新与研发相关的数据库
echo  '暂无。'
# npx  browserslist@latest  --update-db





# -------------------------------------------------------
#           其他交代
# -------------------------------------------------------

Write-吴乐川管理某_npm_项目__打印提示语__其他交代
echo  '暂无。'
