source  ./源代码/发布的源代码/bash/吴乐川-管理某-npm-项目的依赖包等资源.sh



# Update-吴乐川更新当前_npm_项目的某批依赖包 \
#     --这批依赖包之依赖类别='本产品拟囊括这些软件之整体或部分' \
#     --某依赖包之版本配置='   vue    |||       2.6      |||    因为我想缓缓0000。 ' \
#     --某依赖包之版本配置='vue-router        ||| ~3.4 ||| 因为我想缓缓1111。' \
#     --某依赖包之版本配置='vuex ||| ~3.4 |||  因为我想缓缓2222。' \
#     --某依赖包之版本配置='vu*ex ||| ~3.4 |||  因为我想缓缓2222。' \
#     --某依赖包之版本配置='@zhong-hua/packageA ||| null |||  因为我想缓缓2222。' \
#     --某依赖包之版本配置='@zhong-hua/package-b ||| $null |||  因为我想缓缓2222。' \
#     --某依赖包之版本配置='@zhong-hua/package-c ||| 0 |||  因为我想缓缓2222。' \
#     --应仅作仿真演练=0

Update-吴乐川更新当前_npm_项目的某批依赖包 \
    --这批依赖包之依赖类别='本产品拟囊括这些软件之整体或部分' \
    --某依赖包之版本配置='   vue    |||       2.6      |||    因为我想缓缓0000。 ' \
    --某依赖包之版本配置='vue-router        ||| ~3.4 ||| 因为我想缓缓1111。' \
    --某依赖包之版本配置='vuex ||| ~3.4 |||  因为我想缓缓2222。' \
    --某依赖包之版本配置='@zhong-hua/package-a ||| null ' \
    --某依赖包之版本配置='@zhong-hua/package-cde ||| 0 |||  因为我想缓缓2222。' \
    --应仅作仿真演练=0
